cases/annulus/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4000
(
(0.289170214405984 0.00454264873010254 0)
(0.288884838316309 0.0136234631444516 0)
(0.288314367768704 0.0226908328454578 0)
(0.287459365748727 0.0317358094339429 0)
(0.286320676040146 0.0407494666100275 0)
(0.284899422392228 0.0497229089823106 0)
(0.283197007410732 0.0586472808465478 0)
(0.281215111173711 0.0675137749251614 0)
...
)
;

boundaryField
{
    inlet
    {
        type            groovyBC;
         value           uniform (0 0 0);
         variables (
             "Ur=-0.285272198078403;"
             "r=sqrt(pow(pos().x,2)+pow(pos().y,2));"
             "val=vector(Ur*pos().x/r, Ur*pos().y/r, 0);"
         );
         valueExpression "val";
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
