cases/annulus/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
1.03650482873133
1.03650482873133
1.03650482873133
1.03650482873133
1.03650482873133
1.03650482873133
1.03650482873133
1.03650482873133
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.037662503736345;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.837929055827603;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
